main/src/Documents/Документ/Документ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Документ</name>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
    <attributes>
      <name>Реквизит1</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Реквизит2</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Реквизит3</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

main/src/Documents/Документ/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Для Инд = 1 По 10 Цикл
			НоваяСтрока = Объект.ТабличнаяЧасть.Добавить();
			НоваяСтрока.Реквизит1 = Инд;
			НоваяСтрока.Реквизит2 = СтрШаблон("Значение %1", Инд);
		КонецЦикла;
	КонецЕсли;
	
	УстановитьУсловноеОформление();
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	ПостроительУО = МОД_ОбщегоНазначения.НовыйПостроительУсловногоОформления(УсловноеОформление);
	
	ПостроительУО.Добавить()
		.УстановитьСвойство("Представление", "Проверка")
		.Оформление("ЦветФона", WebЦвета.ЛососьСветлый)
		.ОтборЗначение("Объект.ТабличнаяЧасть.Реквизит1", 1)
		.Поля("Реквизит2", "ТабличнаяЧасть");

	ПостроительУО.Добавить()
		.Оформление("ЦветФона", WebЦвета.СветлоЗеленый)
		.Отбор("Объект.ТабличнаяЧасть.Реквизит1", ВидСравненияКомпоновкиДанных.Равно, 2)
		.Поля("Реквизит2", "ТабличнаяЧасть");

	ПостроительУО.Добавить()
		.Оформление("ЦветФона", WebЦвета.СеребристоСерый)
		.ГруппаОтборов("ИЛИ")
			.ОтборЗначение("Объект.ТабличнаяЧасть.Реквизит1", 3)
			.ОтборЗначение("Объект.ТабличнаяЧасть.Реквизит1", 4)
			.Условие(Ложь)
				.ОтборЗначение("Объект.ТабличнаяЧасть.Реквизит1", 5)
				.КонецУсловия()
			.КонецГруппы()
		.Поля("Реквизит2", "ТабличнаяЧасть");

	ПостроительУО.Добавить()
		.Оформление("ТолькоПросмотр", Истина)
		.Отбор("Объект.ТабличнаяЧасть.Реквизит1", ВидСравненияКомпоновкиДанных.Равно, 6)
		.Поля("*", Элементы.ТабличнаяЧастьГруппа1);
		
	ПостроительУО.Добавить()
		.Оформление("ТолькоПросмотр", Истина)
		.Отбор("Объект.ТабличнаяЧасть.Реквизит1", ВидСравненияКомпоновкиДанных.Равно, 7)
		.Поля(Элементы.ТабличнаяЧасть);
КонецПроцедуры
